# SQLITE & POSTGRES
[datacarpentry.org](https://datacarpentry.org/python-ecology-lesson/09-working-with-sql/index.html)

In [1]:
import pandas as pd 
import sys   
sys.path.append('/Users/oliverdreger/Documents/mygit/')
import omdutils as omd

In [2]:
print('Version omdutils: {}'.format(omd.__version__))

Version omdutils: 8.6.2022

In [3]:
print(help(omd.from_sqlite))

Help on function from_sqlite in module omdutils:

from_sqlite(sql: str, database: str) -> pandas.core.frame.DataFrame
    This function pulls data from a SQLite database and returns a dataframe object

    Args:
        sql (str): This SQL statement determines which data is pulled
        database (str): The name of the database from which to pull the data

None

In [4]:
df = omd.from_sqlite(sql='select * from titanic_train limit 3', database='datasets.db')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,,S

In [19]:
df = omd.from_sqlite(sql='''select * from titanic_test''', database='datasets.db')
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0,,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,,0,0,A.5. 3236,8.05,,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.25,,S
416,1308,3,"Ware, Mr. Frederick",male,,0,0,359309,8.05,,S
417,1309,3,"Peter, Master. Michael J",male,,1,1,2668,22.3583,,C

In [4]:
df = omd.from_postgres(sql='select * from bike_rentals_cleaned limit 3', 
                       database='Datasets')
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   instant     3 non-null      int64
 1   season      3 non-null      float64
 2   yr          3 non-null      float64
 3   mnth        3 non-null      float64
 4   holiday     3 non-null      float64
 5   weekday     3 non-null      float64
 6   workingday  3 non-null      float64
 7   weathersit  3 non-null      int64
 8   temp        3 non-null      float64
 9   atemp       3 non-null      float64
 10  hum         3 non-null      float64
 11  windspeed   3 non-null      float64
 12  cnt         3 non-null      int64
dtypes: float64(10), int64(3)
memory usage: 440.0 bytes

,instant,season,yr,mnth,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,cnt
0,1,1.0,0.0,1.0,0.0,6.0,0.0,2,0.344167,0.363625,0.805833,0.160446,985
1,2,1.0,0.0,1.0,0.0,0.0,0.0,2,0.363478,0.353739,0.696087,0.248539,801
2,3,1.0,0.0,1.0,0.0,1.0,1.0,1,0.196364,0.189405,0.437273,0.248309,1349

In [15]:
# SQLite
df = omd.from_sqlite('''select * from titanic_test limit 2''', 'datasets.db')

In [7]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C

In [ ]:
# SQLite
omd.to_sqlite(df, 'omd', 'datasets.db')

In [58]:
# POSTGRESQL
omd.to_postgres(df, 'omd', 'Datasets')

In [14]:
print(help(omd.from_postgres))

Help on function from_postgres in module omdutils:

from_postgres(sql, database)
    This function pulls data from a POSTGRES database and returns a dataframe object

    Args:
        sql (str): This SQL statement determines which data is pulled
        database (str): This is the name of the database from which to pull the data

None

In [13]:
# POSTGRESQL
df = omd.from_postgres(sql='''select * from titanic_train'''
                  ,database='Datasets')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S